// створити масив та вивести його в консоль:
// - з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу

// let arrNumber = [1, 2, 3, 4, 5];
// let arrString = ['a', 'b', 'c', 'd', 'e'];
// let arr = [1, 2, 3, 4, 5, 'a', 'b', 'c', 'd', 'e', true, false];
// console.log(arrNumber);
// console.log(arrString);
// console.log(arr);
//_____________________________________________________________________________________________________________________

// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль

// let arr = [];
// arr[0] = 'hello';
// arr[1] = 'owu';
// console.log(arr);
//_____________________________________________________________________________________________________________________

// -- створити об'єкт (не меньше 5ти властивостей) який описує
// - собаку
// - людину
// - автомобіль
// - квартиру
// - книгу

// let obj = {
//         dog: 'Bob',
//         person: 'Pavlo',
//         car: 'audi',
//         flat: '80 m2',
//         book: 'JS for kids'
// };
//_____________________________________________________________________________________________________________________

// -- Створити масив та вивести його в консоль:
// - з 5 собак
// - 3 5 людей
// - з 5 автомобілів
// let arr = [
//     'pitbul', 'taxa', 'bulldog', 'shpic', 'bigl',
//     'Pahsa', 'Mery', 'Max', 'Olya', 'Ivan',
//     'audi', 'bmw', 'porhe', 'toyota', 'subaru'
// ];

// console.log(arr);
//_____________________________________________________________________________________________________________________

// -- створити об'єкт (не меньше 5ти властивостей) який описує, одна з властивостей обов'язково повинна бути об'єктом,
// ще одна - масивом
// - будинок
// - водій
// - іграшку
// - стіл
// - сумка

// let object = {
//         house: ['two flour', '120 m2', '8 roms'],
//         driver: {name: 'Ivan', age: 30, car: 'Volvo truck'},
//         toy: 'teddy bear',
//         table: '150*130',
//         bag: 'chanell'
// };

//_____________________________________________________________________________________________________________________

// Дан массив:
//     let users = [
//         {name: 'vasya', age: 31, status: false},
//         {name: 'petya', age: 30, status: true},
//         {name: 'kolya', age: 29, status: true},
//         {name: 'olya', age: 28, status: false},
//         {name: 'max', age: 30, status: true},
//         {name: 'anya', age: 31, status: false},
//         {name: 'oleg', age: 28, status: false},
//         {name: 'andrey', age: 29, status: true},
//         {name: 'masha', age: 30, status: true},
//         {name: 'olya', age: 31, status: false},
//         {name: 'max', age: 31, status: true}
//     ];
// - звернутися в відповідну ячейку масиву і відповідний параметр об'єкта і вивести в консольх наступне
// - статус Андрія
// console.log(users[7].status);

// - статус Максима
// console.log(users[4].status);

// - ім'я передостаннього об'єкту
// console.log(users[9].name);

// - ім'я третього об'єкта
// console.log(users[2].name);

// - вік Олега
// console.log(users[6].age);

// - вік Олі
// console.log(users[3].age);

// - вік + ім'я 5го об'єкта
// console.log(users[5].age+users[5].name);

// - вік + сатус Анни
// console.log(users[5].age+' '+users[5].status);

//_____________________________________________________________________________________________________________________
// -Візьміть файл task2_template_2.html, підключіть до нього скрипт, і працюйте в ньому.

// -- Напишіть код,  який за допомоги document.getElementById або document.getElementsByClassName або
// document.getElementsByTagName :
// - отримує текст з параграфа з id "content"
// let content = document.getElementById('content');

// - отримує текст з блоку з id "rules"
// let rules = document.getElementById('rules');

// - замініть текст параграфа з id 'content' на будь-який інший
// content.innerText = 'new text';

// - замініть текст параграфа з id 'rules' на будь-який інший
// rules.innerText = 'new rules';

// - змініть кожному елементу колір фону на червоний
// let fonColor = document.querySelector('body');
// fonColor.style.backgroundColor = 'red';

// - змініть кожному елементу колір тексту на синій
// let textColor = document.querySelector('body');
// textColor.style.color = 'blue';

// - отримати весь список класів елемента з id=rules і вивести їх в console.log
// let rules = document.getElementById('rules');
// console.log(rules);

// - отримати всі елементи з класом fc_rules
// let fcRules = document.getElementsByClassName('fc_rules');
// console.log(fcRules);

// - поміняти колір тексту у всіх елементів fc_rules на червоний
// for (let i=0; i<fcRules.length; i++) {
//     fcRules[i].style.color = 'red';
// }
//_____________________________________________________________________________________________________________________
//_____________________________________________________________________________________________________________________
//_____________________________________________________________________________________________________________________

// Додаткові завдання від Віті
// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
let arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];

// 1. перебрати його циклом while
let i = 0;
while (i < arr.length) {
    console.log(arr[i]);
    i++
}

//_____________________________________________________________________________________________________________________
// 2. перебрати його циклом for
for (let j = 0; j < arr.length; j++) {
    console.log(arr[j]);
}

//_____________________________________________________________________________________________________________________
// 3. перебрати циклом while та вивести числа тільки з непарним індексом
let w = 0;
while (w < arr.length) {
    if (w % 2 !== 0) {
        console.log(arr[w]);
    }
    w++;
}

//_____________________________________________________________________________________________________________________
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
for (let e = 0; e < arr.length; e++) {
    if (e % 2 !== 0) {
        console.log(arr[e]);
    }
}

//_____________________________________________________________________________________________________________________
// 5. перебрати циклом while та вивести  числа тільки парні  значення
let t = 0;
while (t < arr.length) {
    if (arr[t] % 2 === 0) {
        console.log(arr[t]);
    }
    t++;
}

//_____________________________________________________________________________________________________________________
// 6. перебрати циклом for та вивести  числа тільки парні  значення
for (let y = 0; y < arr.length; y++) {
    if (arr[y] % 2 === 0) {
        console.log(arr[y]);
    }
}

//_____________________________________________________________________________________________________________________

// 7. замінити кожне число кратне 3 на слово "okten"
for (let i = 0; i < arr.length; i++) {
    if (arr[i] % 3 === 0) {
        arr[i] = 'okten';
    }
}
console.log(arr);

//_____________________________________________________________________________________________________________________
// 8. вивести масив в зворотньому порядку.
let arr2 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];

for (let u = arr2.length - 1; u >= 0; u--) {
    console.log(arr2[u]);
}

//_____________________________________________________________________________________________________________________

// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
//_______1 в зворотньому циклі/ перебрати його циклом while
let iRev = arr2.length - 1;
while (iRev >= 0) {
    console.log(arr2[iRev]);
    iRev--;
}

//_______2 в зворотньому циклі/ перебрати його циклом for
for (let jRev = arr2.length - 1; jRev >= 0; jRev--) {
    console.log(arr2[jRev]);
}

//_______3 в зворотньому циклі/ перебрати циклом while та вивести числа тільки з непарним індексом
let wRev = arr2.length - 1;
while (wRev >= 0) {
    if (wRev % 2 !== 0) {
        console.log(arr2[wRev]);
    }
    wRev--;
}

//_______4 в зворотньому циклі/ перебрати циклом for та вивести  числа тільки з непарним індексом
let arr3 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];

for (let eRev = arr3.length - 1; eRev >= 0; eRev--) {
    if (eRev % 2 !== 0) {
        console.log(arr3[eRev]);
    }
}
//_______5 в зворотньому циклі/ перебрати циклом while та вивести  числа тільки парні  значення
let tRev = arr3.length - 1;
while (tRev >= 0) {
    if (arr3[tRev] % 2 === 0) {
        console.log(arr3[tRev]);
    }
    tRev--;
}

//_______6 в зворотньому циклі/ перебрати циклом for та вивести  числа тільки парні  значення
for (let yRev = arr3.length - 1; yRev >= 0; yRev--) {
    if (arr3[yRev] % 2 === 0) {
        console.log(arr3[yRev]);
    }
}

//_____________________________________________________________________________________________________________________
// 10. створити пустий масив та :
// 1. заповнити його 50 парними числами за допомоги циклу.
let emptyArray = [];

for (let z = 2; z <= 100; z = z + 2) {
    emptyArray.push(z);
}
console.log(emptyArray);

//_____________________________________________________________________________________________________________________
// 2. заповнити його 50 непарними числами за допомоги циклу.
let emptyArray2 = [];
for (let x = 1; x < 100; x = x + 2) {
    emptyArray2.push(x);
}
console.log(emptyArray2);

//_____________________________________________________________________________________________________________________
// 3. используя Math.random заполнить массив из ???(сколько хотите) элементов.
let emptyArray3 = [];
for (let c = 0; c < 30; c++) {
    emptyArray3[c] = Math.round(Math.random() * 100);
}
console.log(emptyArray3);

// диапазон рандома 8 до 732. (но сначала пробуйте БЕЗ ДИАПАЗОНА!)
let emptyArray4 = [];
for (let v = 0; v < 30; v++) {
    emptyArray4[v] = Math.round(Math.random() * 724) + 8;
}
console.log(emptyArray4);


//_____________________________________________________________________________________________________________________
// 2. вывести на консоль  каждый третий елемент
for (let b = 0; b < emptyArray4.length; b += 3) {
    console.log(emptyArray4[b]);
}

//_____________________________________________________________________________________________________________________
// 3. вывести на консоль  каждый третий елемент но при условии что его значение является парным.
let eray5 = [3, 4, 5, 6, 8, 15, 45, 8789, 154, 515, 1548, 184, 1519, 8, 1, 24, 8, 2, 18, 4, 12, 5, 48, 41, 20, 4, 8,
    48, 48, 4, 84, 5, 184, 65, 4, 2, 3, +95, 5232, 5, 91, 7, 162, 198, 4, 621, 94, 5, 1, 984, 5, 16, 1, 56, 219, 1,
    48185, 1, 51, 481, 58, 17, 15, 19, 18, 4, 56, 1, 1, 231, 87, 41, 51, 7, 1, 541, 781, 5168, 15, 18, 1, 981, 8198];

for (let n = 0; n < eray5.length; n += 3) {
    if (eray5[n] % 2 === 0) {
        console.log(eray5[n]);
    }
}

//_____________________________________________________________________________________________________________________
// 4. вывести на консоль каждый третий елемент но при условии что он имеет парное значение и записать их в другой массив.
let newArray = [];
for (let m = 0; m < eray5.length; m += 3) {
    if (eray5[m] % 2 === 0) {
        console.log(eray5[m]);
        newArray.push(eray5[m]);
    }
}
console.log(newArray);
//_____________________________________________________________________________________________________________________
// 5. Вывести каждый елемент массива у которого соседний с права элемент - парный
let eray6 = [3, 4, 5, 6, 8, 15, 45, 8789, 154, 515, 1548, 184, 1519, 8, 1, 24, 8, 2, 18, 4, 12, 5, 48, 41, 20, 4, 8,
    48, 4, 84, 5, 184, 65, 4, 2, 3, +95, 5232, 5, 91, 7, 162, 198, 4, 621, 94, 5, 1, 984, 5, 16, 1, 56, 219, 1,
    48185, 1, 51, 481, 58, 17, 15, 19, 18, 4, 56, 1, 1, 231, 87, 41, 51, 7, 1, 541, 781, 5168, 15, 18, 1, 981, 8198];

for (let f = 0; f < eray6.length; f++) {
    if (eray6[f + 1] % 2 === 0) {
        console.log(eray6[f]);
    }
}

//_____________________________________________________________________________________________________________________
// 5 масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. обрахувати середній чек.
// Середній чек = сума покупок / кількість покупок
let buyArray = [100, 250, 50, 168, 120, 345, 188];

let sum = 0;
for (k = 0; k < buyArray.length; k++) {
    sum = sum + buyArray[k];
}

let check = sum / buyArray.length;
console.log(check);

//_____________________________________________________________________________________________________________________
// 3 створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.
// Масив з рандомними значеннями вже створений на 288 рядку - let emptyArray3 = [];
let array5 = [];

for (let g = 0; g < emptyArray3.length; g++) {
    emptyArray3[g] = emptyArray3[g] * 5;
    array5.push(emptyArray3[g]);
}

console.log(array5);

//_____________________________________________________________________________________________________________________
// 4 створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому, і якщо об'єкт є числом,
// додати його в інший масив.
let randomArray = ['qwe', 28, 35, 12, 'owu', 1, true, 'ua', false, 50];
let addArray = [];
for (let h of randomArray) {
    if (typeof h == 'number') {
        addArray.push(h);
    }
}

console.log(addArray);
//_____________________________________________________________________________________________________________________

// =================
// =====class=======
// =================
// Взяти файл task2_template_2.html та працювати в ньому
// - Напишіть код, який :

// -- змінює колір тексту елемнту з ід main_header на будь-який інший
let main_headerColor = document.getElementById('main_header');
main_headerColor.style.color = 'green';

//_____________________________________________________________________________________________________________________
// -- робить шириниу елементу ul 400 пікселів
let ulWidth = document.getElementsByTagName('ul');

for (let ii = 0; ii < ulWidth.length; ii++) {
    ulWidth[ii].style.width = '400px';
}

//_____________________________________________________________________________________________________________________
// -- робить шириниу всіх елементів з класом linkList шириною 50%
let linkListWidth = document.getElementsByClassName('linkList');
let oo = 0;
while (oo < linkListWidth.length) {
    linkListWidth[oo].style.width = '50%';
    oo++
}

//_____________________________________________________________________________________________________________________
// -- отримує текст який зберігається в елементі з класом listElement2
let listElement2Text = document.getElementsByClassName('listElement2');
for (let listInnerText of listElement2Text) {
    listElement2Text = listInnerText.innerText;
}

console.log(listElement2Text);

//_____________________________________________________________________________________________________________________
// -- отримує всі елементи li та змінює ім колір фону на сірий
let liGrey = document.getElementsByTagName('li');
for (let liList of liGrey) {
    liList.style.backgroundColor = 'grey';
}
//_____________________________________________________________________________________________________________________
// -- отримує всі елементи 'a' та додає їм клас anchor
let aAnchor = document.getElementsByTagName('a');
for (let aList of aAnchor) {
    aList.classList.add('anchor');
}

//_____________________________________________________________________________________________________________________
// -- отримує всі елементи 'a' та у випадку, якщо текстовий контен елементу дорівнює link3, змінює йому розмір тексту на
// 40 пікселів
for (let aList of aAnchor) {
    if (aList.innerText === 'link3') {
        aList.style.fontSize = '40px';
    }
}

//_____________________________________________________________________________________________________________________
// -- отримує всі елементи 'a' та додає їм клас element_XXX. Де XXX - текстовий контент елементу a
for (let aList of aAnchor) {
    let innerTextA = aList.innerText;
    aList.classList.add(`element_${innerTextA}`);
}

//_____________________________________________________________________________________________________________________
// -- отримує всі елементи 'sub-header' та змінює колір фону. Фон отримати з prompt()
let subBgColor = document.getElementsByClassName('sub-header');
for (let bgColor of subBgColor) {
    bgColor.style.backgroundColor = prompt('Enter color');
}

//_____________________________________________________________________________________________________________________
// -- отримує всі елементи 'sub-header' та змінює колір тексту у видаку якщо текст елемнту = content 2 segment.
// Колір отримати з prompt()
for (let textColor of subBgColor) {
    if (textColor.innerText === 'content 2 segment') {
        textColor.style.color = prompt('Enter text color');
    }
}

//_____________________________________________________________________________________________________________________
// -- отримує елемент з класом content_1 та заміняє  в ньому тест на довільний. Текст отримати з prompt()
let content_1Text = document.getElementsByClassName('content_1');
for (let content_1InnerText of content_1Text) {
    content_1InnerText.innerText = 'Hello owu';
}
//_____________________________________________________________________________________________________________________
// -- отримати елементи p та змінити їм paddin на довільне значення
let pPadding = document.getElementsByTagName('p');
for (let pp of pPadding) {
    pp.style.padding = '30px';
}

//_____________________________________________________________________________________________________________________
// -- отримати елементи з класом text2 та змінити їм текст на довільне значення
let text2Text = document.getElementsByClassName('text2');
for (let text2InnerText of text2Text) {
    text2InnerText.innerText = 'The END'
}

//_____________________________________________________________________________________________________________________